УчетВУправляющихДляГит1/src/Enums/СостоянияРеестровЭЛН/СостоянияРеестровЭЛН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияРеестровЭЛН</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Подготовлен</name>
  </enumValues>
  <enumValues>
    <name>ПринятФСС</name>
  </enumValues>
  <enumValues>
    <name>НеПринятФСС</name>
  </enumValues>
  <enumValues>
    <name>ЧастичноПринятФСС</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Enums/СостоянияРеестровЭЛН/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(ПринятФСС, Строка(ПринятФСС));
	ДанныеВыбора.Добавить(ЧастичноПринятФСС, Строка(ЧастичноПринятФСС));
	ДанныеВыбора.Добавить(НеПринятФСС, Строка(НеПринятФСС));
КонецПроцедуры

#КонецОбласти
